# 타이타닉 데이터를 활용한 이진 생존 분류
- Downloads https://www.kaggle.com/c/titanic
- kaggle.com - 데이터 공개 사이트. 회사에서 데이터 공개 후 분석 잘하는 사람에게 상금 주는 대회 개최.

### 1. Data Descripstion
- total : 139명
- train.csv : 891 x 12
- test.csv : 418 x 11

- Survival : 0=No, 1=Yes
- Pclass : 1=1st, 2=2nd, 3=3rd (숫자가 낮을 수록 높은 등급)
- SibSp = Siblings-Spouses
- Parch = Parants-Children

### 2. Import module

- 모듈 호출시 as를 붙여 줄여서 부를 수 있음. ex) numpy->np, tensorflow->tf

In [2]:
import pandas as pd  #데이터 전처리, 탐색, 분석
import numpy as np  #t수치해석 모듈
import matplotlib.pyplot as plt  #그래프 그리는 모듈

### 3. Data Load

- read_csv() : csv파일 읽어주는 pandas모듈의 함수
- 경로 : 범용성을 위해 상대경로를 사용한다.
    - 절대 경로 : 대상의 경로를 처음부터 끝까지 모두 표시
    - 상대 경로 : 해당 노트북 파일의 경로를 시 작점으로 대상의 경로 설명.
        - ' . ' : 현재
        - ' .. ' : 뒤로가기
        - ' / ' : 들어가기
- head() 데이터 프레임의 처음 다섯건만 표시, tale() :마지막 다섯건만 표시

In [6]:
df_titanic=pd.read_csv('./dataset/train.csv')
df_test = pd.read_csv('./dataset/test.csv')
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S